flashcards/app/controllers/cards_controller.rb

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "cards".* FROM "cards" WHERE "cards"."deck_id" = 1 AND "cards"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @deck = Deck.find(params[:deck_id])
    @card = @deck.cards.find(params[:id])