flashcards/app/controllers/decks_controller.rb

SELECT "decks".* FROM "decks"
---
  def index
    @decks = Deck.all

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "3"]]
---
  def show
    @deck = Deck.find(params[:id])

INSERT INTO "decks" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 05 Apr 2013 20:35:24 UTC +00:00], ["name", "Spanish"], ["updated_at", Fri, 05 Apr 2013 20:35:24 UTC +00:00]]
---
  def create
    @deck = Deck.new(params[:deck])
    @deck.save

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @deck = Deck.find(params[:id])

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "decks" SET "name" = 'Japanese 1', "updated_at" = '2013-04-05 21:11:34.065041' WHERE "decks"."id" = 1
---
  def update
    @deck = Deck.find(params[:id])
    @deck.update_attributes(params[:deck])

SELECT "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 4]]
---
  def destroy
    @deck = Deck.find(params[:id])
    @deck.destroy